computeFundamentalForms(Surface!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double!System.Runtime.CompilerServices.IsConst*,System.Double(*)[N2],System.Double(*)[N2])
Compute the first and second fundamental forms of a surface at a given point.
Input: surf, uv: a surface and the coordinates of a point on it.
Output (both optional): the matrices representing the first and second fundamental
forms of the surface at the given point, in the surface's parameter space.
Note: the sign of the second fundamental form is chosen so that curvature
toward the surface normal is positive.